# Taps
# Note: homebrew/core and homebrew/cask are now included by default, no need to tap
tap "charmbracelet/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "buo/cask-upgrade"
tap "localstack/tap"
tap "sst/tap"
tap "sdkman/tap"

# ----------------------------------------------------------------
# Cask Install Options
# ----------------------------------------------------------------
# appdir: "/Applications"
#   Place all GUI applications together in /Applications.
#
# no_quarantine: true
#   Skip the initial Gatekeeper dialog "App downloaded from the Internet..." on first launch.
cask_args appdir: "/Applications", no_quarantine: true

# Binaries
brew "zsh" # UNIX shell (command interpreter)
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "telnet" # TCP/IP client for accessing remote services
brew "fastfetch" # Fast, highly customisable system info script
brew "openssl@3" # Cryptography and SSL/TLS Toolkit
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "dust" # More intuitive version of du in rust
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "jq" # Lightweight and flexible command-line JSON processor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "thefuck" # Programmatically correct mistyped console commands
brew "tlrc" # tldr-pages is a collection of community-maintained help pages for command-line tools
brew "mcfly" # Fly through your shell history
brew "mas" # Mac App Store command line interface
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "stow" # Symlink manager for dotfiles
brew "wget" # Internet file retriever  

# Zsh plugins
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-history-substring-search" # Zsh port of Fish shell's history search
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew "zsh-you-should-use" # ZSH plugin that reminds you to use existing aliases for commands you just typed

# Development tools
cask "visual-studio-code" # IDE redefined and optimised for building and debugging modern web and cloud applications
brew "sdkman-cli" # The SDKMAN Command Line Interface https://github.com/sdkman/sdkman-cli
brew "spring-io/tap/spring-boot"
cask "beyond-compare" # Compare files and folders
cask "brave-browser" # Web browser focusing on privacy
cask "redis-insight" # GUI for streamlined Redis application development
cask "cap" # Screen recording software
brew "go" # Go programming language
brew "goose" # Go Language's command-line interface for database migrations https://pressly.github.io/goose/  
brew "rbenv" # Ruby version manager https://github.com/rbenv/rbenv#readme
brew "ruby-build" # Install various Ruby versions and implementations https://github.com/rbenv/ruby-build
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "gh" # GitHub CLI
brew "act" # Run your GitHub Actions locally https://github.com/nektos/act
brew "lazygit" # Simple terminal UI for git commands
brew "git-secrets" # Additional git secrets protection
brew "gitleaks" # Git secrets scanner for detecting hardcoded secrets
brew "libyaml" # YAML Parser
brew "yamllint"	# YAML linter
brew "shellcheck"	# Shell script linter
brew "bats-core" # Bash testing framework
brew "renovate"	# Dependency updates
brew "yarn" # JavaScript package manager
brew "fnm" # Fast and simple Node.js version manager
brew "pnpm" # Fast, disk space efficient package manager
brew "oven-sh/bun/bun" # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
# brew "postgresql@18" # PostgreSQL (version 18)
brew "libpq" # PostgreSQL C client library
brew "sqlite" # SQLite is a C-language library SQL database engine
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "pyenv" # Simple Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "uv" # Extremely fast Python package installer and resolver, written in Rust
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "poppler" # PDF rendering library (based on the xpdf-3.0 code base)
brew "posting" # Modern API client that lives in your terminal
brew "docker" # Pack, ship and run any application as a lightweight container
brew "docker-compose" # Isolated development environments using Docker
brew "hadolint"	# Dockerfile linter
brew "cosign" # Container Signing
brew "sevenzip" # 7-Zip is a file archiver with a high compression ratio
brew "age" # Simple, modern, secure file encryption
brew "sops" # Simple and flexible tool for managing secrets
brew "awscli" # Universal Command Line Interface for Amazon Web Services
brew "aws-sso-util" # AWS SSO utility
brew "azure-cli" # Azure management 
cask "gcloud-cli"	# GCP management
cask "android-studio" # Tools for building Android applications https://developer.android.com/studio  

# Kubernetes tools
brew "kubernetes-cli" # Kubernetes command-line interface
brew "kustomize" # Template-free customization of Kubernetes YAML manifests
brew "minikube" # Run a Kubernetes cluster locally
brew "helm" # Kubernetes package manager
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos
brew "k9s" # Kubernetes CLI To Manage Your Clusters In Style!
brew "kubecolor" # Colorize your kubectl output
brew "dyff" # δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "argocd" # Declarative continuous deployment for Kubernetes
brew "kubeseal" # Kubernetes controller and tool for one-way encrypted Secrets
cask "openlens" # OpenLens Kubernetes IDE

# Terraform tools
brew "tenv" # OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "checkov" # Prevent cloud misconfigurations during build-time for IaC tools
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terrascan" # Detect compliance and security violations across Infrastructure as Code
brew "tflint" # Linter for Terraform files
brew "tfsec" # Static analysis security scanner for your terraform code
brew "tfupdate" # Update version constraints in your Terraform configurations
brew "infracost" # Cloud cost estimates for Terraform projects
brew "localstack/tap/localstack-cli" # LocalStack CLI

# AI tools
brew "ollama" # Create, run, and share large language models (LLMs)
brew "microsoft/foundrylocal/foundrylocal" # 
brew "sst/tap/opencode" # The AI coding agent built for the terminal.
brew "gemini-cli" # Gemini CLI
cask "lm-studio" # LM Studio for Model Development.
cask "cursor" # Cursor is a AI-powered IDE for developers.
cask "cursor-cli" # CLI for Cursor, the AI-powered code editor.
cask "claude-code" # Claude Code (claude.ai/code) is a development environment for AI agents.
cask "warp" # Blazingly fast, Rust-based terminal with AI features
cask "kiro" # Agent-centric IDE with spec-driven development https://kiro.dev/
cask "antigravity" # Antigravity is Google AI-powered IDE for developers.

# Apps
cask "1password" # Password manager to store and manage your passwords securely
cask "firefox" # Web browser focused on privacy and security
cask "chatgpt" # OpenAI's official ChatGPT desktop app
cask "claude" # Anthropic's official Claude AI desktop app
cask "cloudflare-warp" # Free app that makes your Internet safer
cask "raycast" # Fast, efficient alternative to Spotlight
cask "stats" # System monitor for the menu bar
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "slack" # Team communication and collaboration tool
cask "discord" # Chat platform for communities and teams
cask "github" # Desktop client for GitHub repositories
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "notion" # App to write, plan, collaborate, and get organised
cask "notion-calendar" # Notion calendar App to manage your time and work
cask "tidal" # Music streaming service
cask "logi-options+" # Logitech Options+
cask "focusrite-control" # Focusrite Control
cask "flameshot" # Screenshot tool - Fixed https://github.com/flameshot-org/flameshot/issues/3572#issuecomment-2710329826
cask "tableplus" # Native GUI tool for relational databases https://tableplus.com/
cask "slack" # Team communication and collaboration software. https://slack.com
cask "postman"  # Collaboration platform for API development. https://www.postman.com
cask "insomnia" # Insomnia REST, GraphQL, MCP Client for testing APIs and MCPs
cask "bruno" # Open source IDE for exploring and testing APIs
brew "imagemagick" # Tools and libraries to manipulate images in many formats
cask "vlc" # Multimedia player. https://www.videolan.org/vlc
cask "gather" # Virtual video-calling space https://gather.town/
cask "miro" # Online collaborative whiteboard platform https://miro.com/
cask "telegram" # Messaging app with a focus on speed and security https://macos.telegram.org/
cask "signal" # Instant messaging application focusing on security https://signal.org/ 
cask "zoom" # Video communication and virtual meeting platform https://www.zoom.us/
cask "figma" # Collaborative interface design tool. https://www.figma.com
cask "fork" # GIT client　https://fork.dev/
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files https://obsidian.md/
  
  


# Fonts
cask "font-meslo-lg-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "GarageBand", id: 682658836

# VSCode extensions
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "artdiniz.strike-vscode"
vscode "arvkevi.listipy"
vscode "batisteo.vscode-django"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "helixquar.randomeverything"
vscode "irongeek.vscode-env"
vscode "jannchie.ruff-ignore-explainer"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-pyright.pyright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pixl-garden.bongocat"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "ysemeniuk.emmet-live"

# cursor (brewsync extension)
cursor "aaron-bond.better-comments"
cursor "adpyke.codesnap"
cursor "adpyke.vscode-sql-formatter"
cursor "alefragnani.project-manager"
cursor "anthropic.claude-code"
cursor "anysphere.cursorpyright"
cursor "artdiniz.strike-vscode"
cursor "arvkevi.listipy"
cursor "batisteo.vscode-django"
cursor "bierner.color-info"
cursor "bradlc.vscode-tailwindcss"
cursor "catppuccin.catppuccin-vsc"
cursor "catppuccin.catppuccin-vsc-icons"
cursor "charliermarsh.ruff"
cursor "christian-kohler.path-intellisense"
cursor "dart-code.dart-code"
cursor "dart-code.flutter"
cursor "davidanson.vscode-markdownlint"
cursor "dotjoshjohnson.xml"
cursor "eamodio.gitlens"
cursor "file-icons.file-icons"
cursor "formulahendry.auto-rename-tag"
cursor "foxundermoon.shell-format"
cursor "github.vscode-pull-request-github"
cursor "golang.go"
cursor "grapecity.gc-excelviewer"
cursor "hashicorp.terraform"
cursor "helixquar.randomeverything"
cursor "irongeek.vscode-env"
cursor "jannchie.ruff-ignore-explainer"
cursor "kisstkondoros.vscode-gutter-preview"
cursor "mrmlnc.vscode-duplicate"
cursor "ms-pyright.pyright"
cursor "ms-python.debugpy"
cursor "ms-python.isort"
cursor "ms-python.python"
cursor "ms-python.vscode-python-envs"
cursor "ms-toolsai.jupyter"
cursor "ms-toolsai.jupyter-keymap"
cursor "ms-toolsai.jupyter-renderers"
cursor "ms-toolsai.vscode-jupyter-cell-tags"
cursor "ms-toolsai.vscode-jupyter-slideshow"
cursor "ms-vscode.cpptools"
cursor "njpwerner.autodocstring"
cursor "oderwat.indent-rainbow"
cursor "openai.chatgpt"
cursor "pixl-garden.bongocat"
cursor "prisma.prisma"
cursor "redhat.vscode-xml"
cursor "streetsidesoftware.code-spell-checker"
cursor "svelte.svelte-vscode"
cursor "tamasfe.even-better-toml"
cursor "twxs.cmake"
cursor "vscodevim.vim"
cursor "wayou.vscode-todo-highlight"
cursor "wholroyd.jinja"
cursor "wix.vscode-import-cost"
cursor "ysemeniuk.emmet-live"

# antigravity (brewsync extension)
antigravity "aaron-bond.better-comments"
antigravity "adpyke.codesnap"
antigravity "adpyke.vscode-sql-formatter"
antigravity "alefragnani.project-manager"
antigravity "anthropic.claude-code"
antigravity "artdiniz.strike-vscode"
antigravity "arvkevi.listipy"
antigravity "batisteo.vscode-django"
antigravity "bierner.color-info"
antigravity "bradlc.vscode-tailwindcss"
antigravity "catppuccin.catppuccin-vsc"
antigravity "catppuccin.catppuccin-vsc-icons"
antigravity "charliermarsh.ruff"
antigravity "christian-kohler.path-intellisense"
antigravity "dart-code.dart-code"
antigravity "dart-code.flutter"
antigravity "davidanson.vscode-markdownlint"
antigravity "devsense.composer-php-vscode"
antigravity "devsense.intelli-php-vscode"
antigravity "devsense.phptools-vscode"
antigravity "devsense.profiler-php-vscode"
antigravity "eamodio.gitlens"
antigravity "esbenp.prettier-vscode"
antigravity "formulahendry.auto-rename-tag"
antigravity "foxundermoon.shell-format"
antigravity "github.vscode-pull-request-github"
antigravity "golang.go"
antigravity "grapecity.gc-excelviewer"
antigravity "hashicorp.terraform"
antigravity "helixquar.randomeverything"
antigravity "irongeek.vscode-env"
antigravity "jannchie.ruff-ignore-explainer"
antigravity "kisstkondoros.vscode-gutter-preview"
antigravity "llvm-vs-code-extensions.vscode-clangd"
antigravity "meta.pyrefly"
antigravity "mrmlnc.vscode-duplicate"
antigravity "ms-azuretools.vscode-containers"
antigravity "ms-pyright.pyright"
antigravity "ms-python.debugpy"
antigravity "ms-python.python"
antigravity "ms-python.vscode-python-envs"
antigravity "ms-toolsai.jupyter"
antigravity "ms-toolsai.jupyter-keymap"
antigravity "ms-toolsai.jupyter-renderers"
antigravity "ms-toolsai.vscode-jupyter-cell-tags"
antigravity "ms-toolsai.vscode-jupyter-slideshow"
antigravity "ms-vscode.cpptools"
antigravity "njpwerner.autodocstring"
antigravity "oderwat.indent-rainbow"
antigravity "openai.chatgpt"
antigravity "pixl-garden.bongocat"
antigravity "prisma.prisma"
antigravity "redhat.java"
antigravity "redhat.vscode-xml"
antigravity "shopify.ruby-lsp"
antigravity "streetsidesoftware.code-spell-checker"
antigravity "svelte.svelte-vscode"
antigravity "tamasfe.even-better-toml"
antigravity "twxs.cmake"
antigravity "vscjava.vscode-gradle"
antigravity "vscjava.vscode-java-debug"
antigravity "vscjava.vscode-java-dependency"
antigravity "vscjava.vscode-java-pack"
antigravity "vscjava.vscode-java-test"
antigravity "vscjava.vscode-maven"
antigravity "vscodevim.vim"
antigravity "wayou.vscode-todo-highlight"
antigravity "wholroyd.jinja"
antigravity "wix.vscode-import-cost"
antigravity "ysemeniuk.emmet-live"
